local function Reply(msg)
local text = msg.content_.text_

function Mod(msg)
local hash = database:sismember(bot_id..'Mod:User'..msg.chat_id_,msg.sender_user_id_)    
if hash or SudoBot(msg) or Sudo(msg) or BasicConstructor(msg) or Constructor(msg) or Manager(msg) then    
return true    
else    
return false    
end 
end
if text == 'م1' or text == 'م١'  then
if not Mod(msg) then
send(msg.chat_id_, msg.id_,'※︙ عذرا الاوامر هذا لا تخصك ') 
return false
end
print(AddChannel(msg.sender_user_id_))
if AddChannel(msg.sender_user_id_) == false then
local textchuser = database:get(bot_id..'text:ch:user')
if textchuser then
send(msg.chat_id_, msg.id_,'['..textchuser..']')
else
send(msg.chat_id_, msg.id_,'※︙ عذراً عليك الاشتراك في القناة\n※︙قناة الاشتراك ['..database:get(bot_id..'add:ch:username')..']')
end
return false
end
Text = [[
※︙ اهلا بك عزيزي √
※︙ اوامر حماية المجموعـه↓
ٴ---------------------------------------
※︙ قفل ︙ فتح + الامر 
※︙ {بالكتم,بالتقييد,بالطرد}
ٴ---------------------------------------
※︙ الاضافه
※︙ الدردشه
※︙ الدخول
※︙ البوتات
※︙ الاشعارات
※︙ التعديل
※︙ تعديل الميديا
※︙ الاباحي
※︙ الروابط
※︙ المعرفات
※︙ التاك
※︙ الشارحه
※︙ الملصقات
※︙ المتحركه
※︙ الفيديو
※︙ الصور
※︙ الالعاب
※︙ الاغاني
※︙ الصوت
※︙ الكيبورد
※︙ التوجيه
※︙ الملفات
※︙ السيلفي
※︙ الجهات
※︙ الماركداون
※︙ الكلايش
※︙ التكرار
※︙ الفارسيه
※︙ الفشار
※︙ الانكليزيه
※︙ الانلاين
 ٴ---------------------------------------
[ᴄʜ › ᴇᴠᴇᴏᴇ ᴛᴇᴀᴍ ⁦˖](t.me/EvEoE)
]]
send(msg.chat_id_, msg.id_,Text) 
return false
end
----------------------------------------------------------------------------
if text == 'م2' or text == 'م٢'  then
if not Mod(msg) then
send(msg.chat_id_, msg.id_,'※︙ عذرا الاوامر هذا لا تخصك ') 
return false
end
if AddChannel(msg.sender_user_id_) == false then
local textchuser = database:get(bot_id..'text:ch:user')
if textchuser then
send(msg.chat_id_, msg.id_,'['..textchuser..']')
else
send(msg.chat_id_, msg.id_,'※︙ عذراً عليك الاشتراك في القناة\n※︙قناة الاشتراك ['..database:get(bot_id..'add:ch:username')..']')
end
return false
end
Text = [[
※︙ اهلا بك عزيزي √
※︙ اوامر تفعيل وتعطيل ↓
 ٴ---------------------------------------
※︙ تفعيل ~ تعطيل + امر
  ٴ---------------------------------------
※︙ اطردني
※︙ صيح
※︙ ضافني
※︙ الرابط 
※︙ الحظر
※︙ الرفع 
※︙ الايدي
※︙ الالعاب
※︙ ردود المطور
※︙ الترحيب
※︙ ردود المدير
※︙ الردود
※︙ ردود البوت
※︙ اوامر التحشيش
※︙ صورتي
※︙ الزخرفه
※︙ الابراج
※︙ حساب العمر 
※︙ نسبه الرجوله 
※︙ نسبه الانوثه 
※︙ نسبه الكره
※︙ نسبه الحب 
※︙ الاضافات 
※︙ تنبيه الاسماء
※︙ تنبيه المعرف
※︙ تنبيه الصور
※︙ التوحيد
※︙ كتم الاسم
※︙ ٴall
 ٴ---------------------------------------
[ᴄʜ › ᴇᴠᴇᴏᴇ ᴛᴇᴀᴍ ⁦˖](t.me/EvEoE)
]]
send(msg.chat_id_, msg.id_,Text) 
return false
end
----------------------------------------------------------------------------
if text == 'م3' or text == 'م٣'  then
if not Mod(msg) then
send(msg.chat_id_, msg.id_,'※︙ عذرا الاوامر هذا لا تخصك ') 
return false
end
if AddChannel(msg.sender_user_id_) == false then
local textchuser = database:get(bot_id..'text:ch:user')
if textchuser then
send(msg.chat_id_, msg.id_,'['..textchuser..']')
else
send(msg.chat_id_, msg.id_,'※︙ عذراً عليك الاشتراك في القناة\n※︙قناة الاشتراك ['..database:get(bot_id..'add:ch:username')..']')
end
return false
end
Text = [[
※︙ اهلا بك عزيزي √
※︙ اوامر الوضع ~ اضف ↓
 ٴ--------------------------------------
※︙ اضف + امر ↓
 ٴ--------------------------------------
※︙ امر
※︙ رد
※︙ صلاحيه
ٴ------------------------------------
ضع + امر ↓
ٴ------------------------------------
※︙ اسم
※︙ رابط
※︙ ترحيب
※︙ قوانين
※︙ صوره
※︙ وصف
※︙ تكرار + عدد
※︙ لقب + اللقب
ٴ--------------------------------------
[ᴄʜ › ᴇᴠᴇᴏᴇ ᴛᴇᴀᴍ ⁦˖](t.me/EvEoE)
]]
send(msg.chat_id_, msg.id_,Text) 
return false
end
----------------------------------------------------------------------------
if text == 'م4' or text == 'م٤'  then
if not Mod(msg) then
send(msg.chat_id_, msg.id_,'※︙ عذرا الاوامر هذا لا تخصك ') 
return false
end
if AddChannel(msg.sender_user_id_) == false then
local textchuser = database:get(bot_id..'text:ch:user')
if textchuser then
send(msg.chat_id_, msg.id_,'['..textchuser..']')
else
send(msg.chat_id_, msg.id_,'※︙ عذراً عليك الاشتراك في القناة\n※︙قناة الاشتراك ['..database:get(bot_id..'add:ch:username')..']')
end
return false
end
Text = [[
※︙ اهلا بك عزيزي √
※︙ اوامر مسح + الحذف ↓
 ٴ--------------------------------------
※︙ مسح + امر ↓
 ٴ--------------------------------------
※︙ الايدي
※︙ الادمنيه
※︙ المميزين
※︙ ردود المدير
※︙ الاساسين
※︙ المنشئين
※︙ المدراء
※︙ البوتات
※︙ صلاحيه
※︙ ترحيب
※︙ الاسماء المكتومه
※︙ قائمه منع المتحركات
※︙ قائمه منع الصور
※︙ قائمه منع الملصقات
※︙ المحذوفين
※︙ مسح قائمه المنع
ٴ------------------------------------
حذف + امر ↓
ٴ------------------------------------
※︙ امر
※︙ الاوامر المضافه
 ٴ--------------------------------------
[ᴄʜ › ᴇᴠᴇᴏᴇ ᴛᴇᴀᴍ ⁦˖](t.me/EvEoE)
]]
send(msg.chat_id_, msg.id_,Text) 
return false
end
----------------------------------------------------------------------------
----------------------------------------------------------------------------
----------------------------------------------------------------------------
if text == 'م5' or text == 'م٥'  then
if not Mod(msg) then
send(msg.chat_id_, msg.id_,'※︙ عذرا الاوامر هذا لا تخصك ') 
return false
end
if AddChannel(msg.sender_user_id_) == false then
local textchuser = database:get(bot_id..'text:ch:user')
if textchuser then
send(msg.chat_id_, msg.id_,'['..textchuser..']')
else
send(msg.chat_id_, msg.id_,'※︙ عذراً عليك الاشتراك في القناة\n※︙قناة الاشتراك ['..database:get(bot_id..'add:ch:username')..']')
end
return false
end
Text = [[
※︙ اهلا بك عزيزي √
※︙ اوامر تنزيل ورفع ↓↑
 ٴ--------------------------------------
※︙ تنزيل + رفع ↓
 ٴ--------------------------------------
※︙ مميز
※︙ ادمن
※︙ مدير
※︙ منشئ
※︙ منشئ اساسي
※︙ الادمنيه
※︙ ادمن بالكروب
※︙ ادمن بكل الصلاحيات
※︙ القيود
ٴ------------------------------------
※︙ اوامر التغير ↓↑
ٴ------------------------------------
※︙ تغير رد المطور + اسم
※︙ تغير رد منشئ الاساسي + اسم
※︙ تغير رد المنشئ + اسم
※︙ تغير رد المدير + اسم
※︙ تغير رد الادمن + اسم
※︙ تغير رد المميز + اسم
※︙ تغير رد العضو + اسم
※︙ تغير امر الاوامر
※︙ تغير امر م1 › الحد م10
 ٴ--------------------------------------
[ᴄʜ › ᴇᴠᴇᴏᴇ ᴛᴇᴀᴍ ⁦˖](t.me/EvEoE)
]]
send(msg.chat_id_, msg.id_,Text) 
return false
end
----------------------------------------------------------------------------
----------------------------------------------------------------------------
if text == 'م6' or text == 'م٦'  then
if not Mod(msg) then
send(msg.chat_id_, msg.id_,'※︙ عذرا الاوامر هذا لا تخصك ') 
return false
end
if AddChannel(msg.sender_user_id_) == false then
local textchuser = datahso:get(bot_id..'text:ch:user')
if textchuser then
send(msg.chat_id_, msg.id_,'['..textchuser..']')
else
send(msg.chat_id_, msg.id_,'※︙ عذراً عليك الاشتراك في القناة\n※︙قناة الاشتراك ['..datahso:get(bot_id..'add:ch:username')..']')
end
return false
end
Text = [[
※︙ اهلا بك عزيزي √
※︙ اوامر المجموعه
 ٴ--------------------------------------
※︙ الاوامر كتالي ↓
 ٴ--------------------------------------
※︙ استعاده الاوامر
※︙ الادمنيه
※︙ تاك لادمنيه
※︙ كشف القيود
※︙ تعين الايدي
※︙ تنظيف + العدد
※︙ تنظيف  التعديل
※︙ تنظيف الميديا
※︙ تنزيل الكل
※︙ منع + برد
{الصور + متحركه + ملصق}
※︙ المميزين
※︙ حظر ~ الغاء حظر
※︙ المحظورين
※︙ كتم ~ الغاء كتم
※︙ المكتومين
※︙ تقيد + الرقم + سَـاعه
※︙ تقيد + الرقم + يوم
※︙ تقيد + الرقم + دقيقه
※︙ كتم + الرقم + ساعه
※︙ كتم + الرقم + يوم
※︙ كتم + الرقم + دقيقه
※︙ تقيد ~ الغاء تقيد
※︙ طرد
※︙ تثبيت ~ الغاء تثبيت
※︙ الترحيب
※︙ كشف البوتات
※︙ الصلاحيات
※︙ كشف ~ برد ← بمعرف
※︙ تاك للكل
※︙ اعدادات المجموعه
※︙ عدد الكروب
※︙ ردود المدير
※︙ اسم بوت + الرتبه
※︙ الاوامر المضافه
※︙ قائمه المنع
 ٴ--------------------------------------
[ᴄʜ › ᴇᴠᴇᴏᴇ ᴛᴇᴀᴍ ⁦˖](t.me/EvEoE)
]]
send(msg.chat_id_, msg.id_,Text) 
return false
end
----------------------------------------------------------------------------
if text == 'م7' or text == 'م٧'  then
if not Sudo(msg) then
send(msg.chat_id_, msg.id_,'※︙ عذرا الاوامر هذا لا تخصك ') 
return false
end
if AddChannel(msg.sender_user_id_) == false then
local textchuser = datahso:get(bot_id..'text:ch:user')
if textchuser then
send(msg.chat_id_, msg.id_,'['..textchuser..']')
else
send(msg.chat_id_, msg.id_,'※︙ عذراً عليك الاشتراك في القناة\n※︙قناة الاشتراك ['..datahso:get(bot_id..'add:ch:username')..']')
end
return false
end
Text = [[
※︙ اهلا بك عزيزي √
※︙ اوامر المطورين البوت كتالي..↓↑
 ٴ--------------------------------------
※︙ تفعيل ← تعطيل 
※︙ المجموعات ← المشتركين 
※︙ رفع ← تنزيل منشئ اساسي
※︙ مسح الاساسين ← المنشئين الاساسين
※︙ مسح المنشئين ← المنشئين
※︙ اسم + غادر 
※︙ اذاعه / اذا كان مطور اساسي مفعلها
※︙ ردود المطور 
※︙ رفع ←تنزيل مميز عام
※︙ مسح المميزين عام ←المميز العام
 ٴ--------------------------------------
[ᴄʜ › ᴇᴠᴇᴏᴇ ᴛᴇᴀᴍ ⁦˖](t.me/EvEoE)
]]
send(msg.chat_id_, msg.id_,Text) 
return false
end
----------------------------------------------------------------------------
if text == 'م8' or text == 'م٨'  then
if not SudoBot(msg) then
send(msg.chat_id_, msg.id_,'※︙ عذرا الاوامر هذا لا تخصك ') 
return false
end
if AddChannel(msg.sender_user_id_) == false then
local textchuser = datahso:get(bot_id..'text:ch:user')
if textchuser then
send(msg.chat_id_, msg.id_,'['..textchuser..']')
else
send(msg.chat_id_, msg.id_,'※︙ عذراً عليك الاشتراك في القناة\n※︙قناة الاشتراك ['..datahso:get(bot_id..'add:ch:username')..']')
end
return false
end
Text = [[
※︙ اهلا بك عزيزي √
※︙ اوامر مطور الاساسي...↓
 ٴ--------------------------------------
※︙ تفعيل
※︙ تعطيل
※︙ مسح الاساسين
※︙ المنشئين الاساسين
※︙ رفع/تنزيل منشئ اساسي
※︙ مسح المطورين
※︙ المطورين
※︙ رفع ︙ تنزيل مطور
ٴ------------------------------------
※︙ اسم البوت + غادر
※︙ غادر
※︙ اسم بوت + الرتبه
※︙ تحديث السورس
※︙ حضر عام
※︙ كتم عام
※︙ الغاء العام
※︙ قائمه العام
※︙ مسح قائمه العام
※︙ جلب نسخه الاحتياطيه
※︙ رفع نسخه الاحتياطيه
ٴ------------------------------------
※︙ اذاعه خاص
※︙ اذاعه
※︙ اذاعه بالتوجيه
※︙ اذاعه بالتوجيه خاص
※︙ اذاعه بالتثبيت
ٴ------------------------------------
※︙ جلب نسخه البوت
※︙ رفع نسخه البوت
※︙ ضع عدد الاعضاء + العدد
※︙ ضع كليشه المطور
※︙ تفعيل/تعطيل الاذاعه
※︙ تفعيل/تعطيل البوت الخدمي
※︙ تفعيل/تعطيل التواصل
※︙ تغير اسم البوت
※︙ اضف/حذف رد للكل
※︙ ردود المطور
※︙ مسح ردود المطور
ٴ------------------------------------
※︙ الاشتراك الاجباري
※︙ تعطيل الاشتراك الاجباري
※︙ تفعيل الاشتراك الاجباري
※︙ حذف رساله الاشتراك
※︙ تغير رساله الاشتراك
※︙ تغير الاشتراك
ٴ------------------------------------
※︙ الاحصائيات
※︙ المشتركين
※︙ المجموعات 
※︙ تفعيل/تعطيل المغادره
※︙ تنظيف المشتركين
※︙ تنظيف الكروبات
 ٴ---------------------------------------
[ᴄʜ › ᴇᴠᴇᴏᴇ ᴛᴇᴀᴍ ⁦˖](t.me/EvEoE)
]]
send(msg.chat_id_, msg.id_,Text) 
return false
end
----------------------------------------------------------------------------
if text == 'م9' or text == 'م٩'  then
if AddChannel(msg.sender_user_id_) == false then
local textchuser = datahso:get(bot_id..'text:ch:user')
if textchuser then
send(msg.chat_id_, msg.id_,'['..textchuser..']')
else
send(msg.chat_id_, msg.id_,'※︙ عذراً عليك الاشتراك في القناة\n※︙قناة الاشتراك ['..datahso:get(bot_id..'add:ch:username')..']')
end
return false
end
Text = [[
※︙ اهلا بك عزيزي √
※︙ اوامر الاعضاء كتالي…↓
 ٴ--------------------------------------
※︙ عرض معلوماتك ↑↓
 ٴ--------------------------------------
※︙ ايديي ← اسمي 
※︙ رسايلي ← مسح رسايلي 
※︙ رتبتي ← سحكاتي 
※︙ مسح سحكاتي ← المنشئ 
※︙ الرتبه بالرد /بالمعرف
※︙ الحساب + ايدي الشخص
ٴ------------------------------------
※︙ اوآمر المجموعه ↑↓
ٴ------------------------------------
※︙ الرابط ← القوانين – الترحيب
※︙ ايدي ← اطردني 
※︙ اسمي ← المطور  
※︙ كشف / برد بالمعرف
※︙ كول + كلمه
ٴ------------------------------------
※︙ اسم البوت + الامر ↑↓
ٴ------------------------------------
※︙ بوسه بالرد 
※︙ مصه بالرد
※︙ رزله بالرد 
※︙ شنو رئيك بهاذا بالرد
※︙ شنو رئيك بهاي بالرد
※︙ تحب هذا
 ٴ---------------------------------------
[ᴄʜ › ᴇᴠᴇᴏᴇ ᴛᴇᴀᴍ ⁦˖](t.me/EvEoE)
]]
send(msg.chat_id_, msg.id_,Text) 
return false
end
----------------------------------------------------------------------------
if text == 'اوامر التحشيش'  or text == 'م10' or text == 'م١٠'  then
if not Mod(msg) then
send(msg.chat_id_, msg.id_,'※︙ عذراً الاوامر هذي لا تخصك ') 
return false
end
if AddChannel(msg.sender_user_id_) == false then
local textchuser = database:get(bot_id..'text:ch:user')
if textchuser then
send(msg.chat_id_, msg.id_,'['..textchuser..']')
else
send(msg.chat_id_, msg.id_,'※︙عذࢪا عليڪ الاشتࢪاڪ في قناه البوت \n - اشتࢪڪ هنا عمࢪي ['..database:get(bot_id..'add:ch:username')..']')
end
return false
end
local help_text = database:get(bot_id..'help_text')
Text = [[
※︙ اهلا بك عزيزي √
※︙ اوامر التحشيش كتالي…↓
 ٴ--------------------------------------
※︙ رفع + تنزيل ← الامر
 ٴ--------------------------------------
※︙ رفع + تنزيل ← شيخ
※︙ تاك للشيوخ
※︙ تنزيل الشيوخ
ٴ------------------------------------
※︙ رفع + تنزيل ← بكلبي
※︙ تاك لبكلبي
※︙ تنزيل لبكلبي
ٴ------------------------------------
※︙ رفع + تنزيل ← تاج
※︙ تاك للتوج
※︙ تنزيل التوج
ٴ------------------------------------
※︙ رفع + تنزيل ← عروسه
※︙ تاك للعروسات
※︙ تنزيل العروسات
ٴ------------------------------------
※︙رفع + تنزيل ← قرده
※︙رفع + تنزيل ← قرد 
※︙ تاك للقرود
※︙ تنزيل القرود
ٴ------------------------------------
※︙رفع + تنزيل ← حاته
※︙ تاك للحاتات
※︙ تنزيل الحاتات
ٴ------------------------------------
※︙رفع + تنزيل ← حات
※︙ تاك للحاتين
※︙ تنزيل الحاتين
ٴ------------------------------------
※︙ رفع + تنزيل ← دجاجة
※︙ تاك للدجاج
※︙ تنزيل الدجاج
ٴ------------------------------------
※︙ رفع + تنزيل ← زاحف
※︙ تاك لزواحف
※︙ تنزيل زاحف
ٴ------------------------------------
※︙ رفع + تنزيل ← كلبه
※︙ رفع + تنزيل ← كلب
※︙ تاك للكلاب
※︙ تنزيل الكلاب
 ٴ---------------------------------------
[ᴄʜ › ᴇᴠᴇᴏᴇ ᴛᴇᴀᴍ ⁦˖](t.me/EvEoE)
]]
send(msg.chat_id_, msg.id_,(help_text or Text)) 
return false
end

end
return {
Peland = Reply
}
